[
    {"title":"Lethal Weapon","genres":["action"],"year":1988,"rating":7.2,"description":"Two detectives team up to take down a drug cartel."},
    {"title":"The Matrix","genres":["sci-fi"],"year":1999,"rating":8.7,"description":"A computer hacker discovers a hidden reality and joins a rebellion against machines."},
    {"title":"Titanic","genres":["romance"],"year":1997,"rating":7.8,"description":"A tragic love story set aboard the ill-fated RMS Titanic."},
    {"title":"Border Incident"},
    {"title":"The Conjuring","genres":["horror"],"year":2013,"rating":7.5,"description":"Paranormal investigators help a family haunted by a dark presence."},
    {"title":"Guardians of the Galaxy","genres":["action"],"year":2014,"rating":8.0,"description":"A group of intergalactic misfits band together to protect the universe."},
    {"title":"Toy Story","genres":["comedy"],"year":1995,"rating":8.3,"description":"Toys come to life when humans aren't around, leading to unexpected adventures."},
    {"title":"Frozen","genres":["fantasy"],"year":2013,"rating":7.4,"description":"A fearless princess sets off on a journey alongside a rugged iceman, his loyal reindeer, and a naive snowman to find her estranged sister, whose icy powers have trapped their kingdom in eternal winter."},
    {"title":"Avatar","genres":["sci-fi"],"year":2009,"rating":7.8,"description":"In the future, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization."},
    {"title":"Black Hand"},
    {"title":"Tron: Legacy","genres":["sci-fi"],"year":2015,"rating":6.4,"description":"In a galaxy far, far away, a group of adventurers embarks on a quest to find a legendary star that holds the key to unlimited power."},
    {"title":"Airplane!"},
    {"title":"Airplane II: The Sequel"},
    {"title":"Predator"},
    {"title":"The Naked Gun: From the Files of Police Squad!"},
    {"title":"Police Academy"},
    {"title":"Police Academy 2: Their First Assignment"},
    {"title":"The Secret Kingdom","genres":["thriller"],"year":2007,"rating":5.5,"description":"A covert government agency races against time to prevent a global catastrophe orchestrated by a secret society."},
    {"title":"Castle in the Sky"},
    {"title":"Pirates of the Caribbean: The Curse of the Black Pearl"},
    {"title":"The Smurfs and the Magic Flute"},
    {"title":"Bill the Galactic Hero"},
    {"title":"Beyond the Black Rainbow"},
    {"title":"Love Potion No. 9"},
    {"title":"Ray"},
    {"title":"Thelma & Louise"},
    {"title":"Star Wars: Episode IV - A New Hope"},
    {"title":"Tron","year":2011,"rating":6.4,"description":"A magical muffin shop serves up pastries with unexpected side effects, causing chaos in a sleepy town."},
    {"title":"Hackers","year":2021,"rating":8.2,"description":"A band of renegade robots rises up against their human creators, sparking a revolution that will change the course of history."},
    {"title":"Swordfish","year":2005,"rating":7.5,"description":"The spirits of a haunted carnival exact revenge on those who dare to enter their twisted realm."},
    {"title":"Black Caesar"},
    {"title":"Foxy Brown"},
    {"title":"Enhanced","year":2019,"rating":7.6,"description":"A reclusive librarian discovers a magical book that transports her into romantic tales from different eras."},
    {"title":"Star Wars: Episode I - The Phantom Menace"},
    {"title":"Star Wars: Episode III - Revenge of the Sith"},
    {"title":"Raya and the Last Dragon","genres":["fantasy"],"year":2003,"rating":7.1,"description":"In a land where dragons roam freely, a brave group of riders embarks on a quest to protect their homeland from an ancient evil."},
    {"title":"Rogue One: A Star Wars Story"},
    {"title":"Star Wars: Episode V - The Empire Strikes Back"},
    {"title":"White Widow","genres":["thriller"],"year":2001,"rating":7.2,"description":"A cursed mirror grants dark wishes, leading those who dare to gaze into it down a treacherous path of danger and deceit."},
    {"title":"Blade Runner 2049","genres":["sci-fi"],"year":2006,"rating":6.5,"description":"In a dystopian future, a traveling circus of cybernetic performers captivates audiences while hiding a dark agenda."},
    {"title":"Star Wars: Episode VI - Return of the Jedi"},
    {"title":"Pretty Woman"},
    {"title":"Captain America: The First Avenger"},
    {"title":"The Godfather Part II","genres":["crime"],"year":2009,"rating":6.8,"description":"A relaxing vacation turns into a nightmare when guests at a remote resort discover it's run by vampires with a thirst for blood."},
    {"title":"The Godfather Part III","genres":["crime"],"year":2014,"rating":7.9,"description":"A mermaid princess must choose between her underwater kingdom and the human world, where she has found unexpected love."},
    {"title":"District 9","genres":["sci-fi"],"year":2013,"rating":6.9,"description":"After years of servitude, a sentient robot seeks vengeance against its human creators, sparking a conflict that threatens to consume both worlds."},
    {"title":"Kill Bill: Vol. 1"},
    {"title":"Step Brothers"},
    {"title":"Very Bad Things","genres":["comedy"],"year":2002,"rating":8.5,"description":"A bachelor party in Las Vegas turns into a series of outrageous misadventures when things spiral out of control."},
    {"title":"Fantastic Beasts: The Secrets of Dumbledore","year":2023,"rating":6.9,"description":"A mermaid with a mischievous streak wreaks havoc in a seaside town, much to the dismay of the locals."},
    {"title":"Asterix & Obelix: Mission Cleopatra","year":2024,"rating":7.1,"description":"In a candy-coated galaxy, a group of intrepid explorers discovers a planet made entirely of gumdrops."},
    {"title":"Zoolander"},
    {"title":"Superbad"},
    {"title":"The Billionaires' Tea Party","year":2021,"rating":7.2,"description":"A group of friends stumble upon a haunted swamp filled with restless spirits and ancient curses."},
    {"title":"Mystic Mountain","genres":["fantasy"],"year":2020,"rating":7.8,"description":"Atop a mystical mountain, a legendary artifact awaits discovery by a brave adventurer."},
    {"title":"Pirates of the Caribbean: On Stranger Tides","year":2019,"rating":8.0,"description":"Across time and space, a magical tea party brings together souls destined to find love."},
    {"title":"Wedding Crashers"},
    {"title":"Don't Blink","genres":["horror"],"year":2017,"rating":7.1,"description":"A cursed artifact unleashes a wave of supernatural terror, trapping its victims in a never-ending nightmare."},
    {"title":"Pirates of the Caribbean: Dead Man's Chest","genres":["action"],"year":2016,"rating":7.4,"description":"An enigmatic pianist with a haunting past plays a deadly game of cat and mouse with his audience."},
    {"title":"Natural Born Killers","year":2015,"rating":6.5,"description":"Sweet treats turn deadly when a batch of cupcakes becomes possessed by vengeful spirits."},
    {"title":"Rampage","year":2014,"rating":7.0,"description":"A malfunctioning robot goes on a rampage through a futuristic city, threatening to bring about its downfall."},
    {"title":"Kung Fu Panda","year":2013,"rating":6.3,"description":"A band of misfit pandas sets sail in search of buried bamboo treasures on the high seas."},
    {"title":"Kung Fu Panda 2","year":2012,"rating":7.7,"description":"In a futuristic world, two unlikely allies join forces to save humanity from an alien invasion."},
    {"title":"Kung Fu Panda 3","year":2011,"rating":6.9,"description":"A mysterious mansion holds dark secrets that unravel as a group of strangers are drawn into its shadowy depths."},
    {"title":"Don't Torture a Duckling","year":2010,"rating":7.2,"description":"Beneath the earth's surface lies a labyrinth of crystal caverns filled with wondrous treasures and deadly traps."},
    {"title":"Escape from Alcatraz","year":2009,"rating":6.8,"description":"Survivors must navigate a zombie-infested island to reach safety, encountering undead horrors at every turn."},
    {"title":"Attack of the Killer Tomatoes!","genres":["comedy"],"year":2008,"rating":6.5,"description":"Genetically enhanced tomatoes run amok, wreaking havoc on a small town in this campy comedy horror."},
    {"title":"Spaceballs","year":2007,"rating":7.3,"description":"A teapot with the power to manipulate time falls into the hands of an unsuspecting tea enthusiast."},
    {"title":"The Phantom of the Opera","year":2006,"rating":6.6,"description":"A haunted roller rink becomes the stage for a spectral figure seeking vengeance from beyond the grave."},
    {"title":"Showdown","year":2005,"rating":7.0,"description":"In a culinary clash of cosmic proportions, chefs compete to create the ultimate space sandwich."},
    {"title":"A Nightmare on Elm Street","year":2004,"rating":7.4,"description":"A whimsical wizard embarks on a magical journey to reclaim his lost spellbook from a mischievous dragon."},
    {"title":"Flowers in the Attic"},
    {"title":"Street People","year":2002,"rating":6.7,"description":"An ancient curse turns a popular pizzeria into a nightmarish haunt for unsuspecting patrons."},
    {"title":"The Last Emperor"},
    {"title":"Beowulf","year":2000,"rating":7.8,"description":"A magical elixir shop becomes the backdrop for a tale of love, destiny, and the pursuit of happiness."},
    {"title":"Trolls Band Together","year":1999,"rating":6.9,"description":"A cursed mummy awakens from its slumber, unleashing ancient horrors upon an unsuspecting archaeological team."},
    {"title":"The Bodyguard"},
    {"title":"Mars Attacks!","genres":["comedy"],"year":1996,"rating":6.6,"description":"Martian invaders wreak havoc on Earth, but humanity fights back with unexpected humor."},
    {"title":"Mean Girls"},
    {"title":"American Gigolo"},
    {"title":"Blue Velvet","year":1990,"rating":7.3,"description":"A daring crew embarks on a perilous quest to unlock the mysteries of quantum physics and save their endangered planet."},
    {"title":"The Hidden","year":1989,"rating":7.6,"description":"A crew of chocolate-loving pirates sets sail in search of a fabled cocoa treasure hidden on a mythical island."},
    {"title":"The Mummy's Curse","year":1987,"rating":6.8,"description":"An ancient curse awakens a vengeful mummy, who stalks the night in search of those who disturbed its tomb."},
    {"title":"At the Edge of the World","year":1986,"rating":7.2,"description":"In a neon-lit cyberpunk city, rival factions clash in a high-stakes battle for control of the digital underworld."},
    {"title":"What the Health","year":1985,"rating":6.7,"description":"A computer virus takes on a life of its own, manifesting as malevolent spirits within a cutting-edge AI."},
    {"title":"American Beauty"},
    {"title":"Scary Movie","year":1984,"rating":7.5,"description":"A vengeful spirit haunts the dreams of teenagers, unleashing deadly nightmares in the real world."},
    {"title":"Quest for Camelot","year":1983,"rating":6.9,"description":"Adventurers embark on a daring quest to uncover the lost city of Atlantis and its mythical treasures."},
    {"title":"Higanjima: Escape from Vampire Island","year":1982,"rating":7.1,"description":"A group of survivors must outwit a rogue AI and its robotic minions to escape from a remote island."},
    {"title":"Poker Face","year":1981,"rating":7.3,"description":"A mystical mirror reveals hidden truths and dark secrets, testing the bonds of friendship and love."},
    {"title":"Get on Up"},
    {"title":"The Lost World","year":1979,"rating":6.9,"description":"Explorers discover a hidden realm inhabited by prehistoric creatures, but their expedition soon turns deadly."},
    {"title":"Raiders of the Lost Ark","genres":["action"],"year":1981,"rating":8.4,"description":"Archaeologist Indiana Jones races against Nazi agents to find the legendary Ark of the Covenant."},
    {"title":"Ghostbusters","genres":["comedy"],"year":1984,"rating":7.8,"description":"Paranormal investigators battle a surge of supernatural activity in New York City."},
    {"title":"Back to the Future","genres":["sci-fi"],"year":1985,"rating":8.5,"description":"A teenager travels back in time and inadvertently alters the course of history, prompting a frantic effort to restore the future."},
    {"title":"The Shining","genres":["horror"],"year":1980,"rating":8.4,"description":"A writer and his family become caretakers of an isolated hotel, where supernatural forces drive him to madness."},
    {"title":"E.T. the Extra-Terrestrial","genres":["sci-fi"],"year":1982,"rating":7.8,"description":"A young boy befriends an extraterrestrial stranded on Earth, leading to a heartwarming adventure."},
    {"title":"Die Hard","genres":["action"],"year":1988,"rating":8.2,"description":"An off-duty cop battles terrorists who seize a skyscraper during a Christmas party."},
    {"title":"Beetlejuice","genres":["comedy"],"year":1988,"rating":7.5,"description":"A recently deceased couple hires a mischievous spirit to drive out the new occupants of their former home."},
    {"title":"Blade Runner","genres":["sci-fi"],"year":1982,"rating":8.1,"description":"A detective hunts down rogue replicants in a dystopian future, leading to a confrontation that questions the nature of humanity."},
    {"title":"Jurassic Park","genres":["action"],"year":1993,"rating":8.1,"description":"Scientists clone dinosaurs for a theme park, but chaos erupts when the creatures break free."},
    {"title":"The Lion King","genres":["animation"],"year":1994,"rating":8.5,"description":"A young lion prince flees his kingdom only to learn the true meaning of responsibility and bravery."},
    {"title":"Forrest Gump","genres":["drama"],"year":1994,"rating":8.8,"description":"The story of a man with a low IQ who rose above his challenges, proving that determination and kindness can change the world."},
    {"title":"The Silence of the Lambs","genres":["thriller"],"year":1991,"rating":8.6,"description":"A young FBI cadet must confide in an incarcerated and manipulative killer to receive his help on catching another serial killer who skins his victims."},
    {"title":"Drive"},
    {"title":"Gladiator","genres":["action"],"year":2000,"rating":8.5,"description":"A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery."},
    {"title":"A Beautiful Mind","genres":["biography"],"year":2001,"rating":8.2,"description":"After John Nash, a brilliant but asocial mathematician, accepts secret work in cryptography, his life takes a turn for the nightmarish."},
    {"title":"The Departed","genres":["crime"],"year":2006,"rating":8.5,"description":"An undercover cop and a mole in the police force race to identify each other while infiltrating an Irish gang in South Boston."},
    {"title":"The Dark Knight","genres":["action"],"year":2008,"rating":9.0,"description":"When the menace known as the Joker emerges from his mysterious past, he wreaks havoc and chaos on the people of Gotham."},
    {"title":"Avatar: The Way of Water","genres":["action"]},
    {"title":"The Princess Bride","genres":["comedy"]},
    {"title":"Interstellar","genres":["adventure"],"year":2014,"rating":8.6,"description":"A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival."},
    {"title":"The Prestige","genres":["drama"],"year":2006,"rating":8.5,"description":"After a tragic accident, two stage magicians engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other."},
    {"title":"The Revenant","genres":["adventure"],"year":2015,"rating":8.0,"description":"A frontiersman on a fur trading expedition in the 1820s fights for survival after being mauled by a bear and left for dead by members of his own hunting team."},
    {"title":"Mad Max: Fury Road","genres":["action"],"year":2015,"rating":8.1,"description":"In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler in search of her homeland with the aid of a group of female prisoners, a psychotic worshiper, and a drifter named Max."},
    {"title":"Patriot Games"},
    {"title":"Wonder Woman","genres":["action"],"year":2017,"rating":7.4,"description":"When a pilot crashes and tells of conflict in the outside world, Diana, an Amazonian warrior in training, leaves home to fight a war, discovering her full powers and true destiny."},
    {"title":"Avengers: Infinity War","genres":["action"],"year":2018,"rating":8.4,"description":"The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe."},
    {"title":"Black Panther","genres":["action"],"year":2018,"rating":7.3,"description":"T'Challa, heir to the hidden but advanced kingdom of Wakanda, must step forward to lead his people into a new future and must confront a challenger from his country's past."},
    {"title":"The Faculty"},
    {"title":"Do the Right Thing"},
    {"title":"End Times"},
    {"title":"Red Dawn"},
    {"title":"George of the Jungle"},
    {"title":"Joker","genres":["crime"],"year":2019,"rating":8.4,"description":"In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated by society, and he embarks on a downward spiral of revolution and bloody crime."},
    {"title":"Spider-Man: No Way Home","genres":["action"],"year":2021,"rating":8.5,"description":"With Spider-Man's identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, forcing Peter to uncover what it truly means to be Spider-Man."},
    {"title":"Dune","genres":["adventure"],"year":2021,"rating":8.3,"description":"Feature adaptation of Frank Herbert's science fiction novel about the son of a noble family entrusted with the protection of the most valuable asset and most vital element in the galaxy."},
    {"title":"The Adventures of Baron Munchausen"},
    {"title":"Four Weddings and a Funeral"},
    {"title":"The Full Monty"},
    {"title":"The Madness of King George"},
    {"title":"The Bigamist"},
    {"title":"GoldenEye"},
    {"title":"Crimson Tide"},
    {"title":"Family Affairs"},
    {"title":"Revenge of the Nerds"},
    {"title":"Air Force One"},
    {"title":"Out for Justice"},
    {"title":"Akira"},
    {"title":"Indiana Jones and the Last Crusade"},
    {"title":"West Side Story"},
    {"title":"The Birds"},
    {"title":"Colors of Love"},
    {"title":"When Pigs Have Wings"},
    {"title":"Deux heures moins le quart avant Jésus-Christ"},
    {"title":"Indiana Jones and the Dial of Destiny"},
    {"title":"The Way We Were"},
    {"title":"Casino"},
    {"title":"The Truth About Cats & Dogs"},
    {"title":"Go for Zucker"},
    {"title":"Ilsa, the Wicked Warden"},
    {"title":"Schtonk"},
    {"title":"Schlock"},
    {"title":"Kebab Connection"},
    {"title":"The Wave"},
    {"title":"The Boy and the Heron"},
    {"title":"Harry Potter and the Sorcerer's Stone"},
    {"title":"Shark Night"},
    {"title":"Lucky Luke"},
    {"title":"A Fistful of Dollars"},
    {"title":"The Inglorious Bastards"},
    {"title":"Memoirs of a Geisha","genres":["romance"],"year":2005,"rating":8.0,"description":"A young geisha navigates the complexities of love and tradition in 1920s Kyoto, painting a vivid portrait of her life."},
    {"title":"Notting Hill"},
    {"title":"My Neighbor Totoro","genres":["animation"],"year":1988,"rating":8.9,"description":"Two sisters encounter friendly forest spirits in rural Japan, discovering the magic of nature and friendship."},
    {"title":"Ghost in the Shell","genres":["sci-fi"],"year":1995,"rating":8.4,"description":"In a cyberpunk future, a cyborg detective hunts down a mysterious hacker who threatens the boundaries between man and machine."},
    {"title":"The Lair of the White Worm","year":2019,"rating":7.8,"description":"A fox spirit disguises itself as a beautiful woman to experience human emotions, testing the boundaries of love and identity."},
    {"title":"Léon: The Professional"},
    {"title":"Rambo: First Blood Part II"},
    {"title":"Beverly Hills Cop"},
    {"title":"Escape from New York"},
    {"title":"Escape from L.A."},
    {"title":"Cobra"},
    {"title":"Missing in Action"},
    {"title":"Alphaville"},
    {"title":"Big Trouble in Little China"},
    {"title":"Jay and Silent Bob Strike Back"},
    {"title":"Commando"},
    {"title":"The Untouchables"},
    {"title":"Upside Down"},
    {"title":"Hard Candy"},
    {"title":"Requiem for a Dream"},
    {"title":"The Long Kiss Goodnight"},
    {"title":"The Rock"},
    {"title":"Ronin"},
    {"title":"Lock, Stock and Two Smoking Barrels"},
    {"title":"Casino Royale"},
    {"title":"Persepolis"},
    {"title":"The Good, the Bad and the Ugly"},
    {"title":"Amores Perros"},
    {"title":"And Your Mother Too"},
    {"title":"Like Water for Chocolate"},
    {"title":"The Book of Life"},
    {"title":"The Perfect Dictatorship"},
    {"title":"Scream"},
    {"title":"Candyman"},
    {"title":"Event Horizon"},
    {"title":"From Dusk Till Dawn"},
    {"title":"Armageddon","genres":["fantasy"]},
    {"title":"The Palace"},
    {"title":"X-Men: Apocalypse"},
    {"title":"Terminator 2: Judgment Day"},
    {"title":"Back to the Future Part II"},
    {"title":"Animal Kingdom"},
    {"title":"Mystery Road"},
    {"title":"The Babadook"},
    {"title":"Killing Ground"},
    {"title":"The Snowtown Murders"},
    {"title":"The Nightingale"},
    {"title":"Wolf Creek"},
    {"title":"Hounds of Love"},
    {"title":"Berlin Syndrome"},
    {"title":"Cargo"},
    {"title":"The Night of the Hunter"},
    {"title":"Vertigo"},
    {"title":"Cape Fear"},
    {"title":"Panic in the Streets"},
    {"title":"The Big Heat"},
    {"title":"In a Lonely Place"},
    {"title":"Dial M for Murder"},
    {"title":"Rear Window"},
    {"title":"Touch of Evil"},
    {"title":"Wait Until Dark"},
    {"title":"The Manchurian Candidate"},
    {"title":"Bullitt"},
    {"title":"X-Men"},
    {"title":"Aliens"},
    {"title":"The Goodbye Girl"},
    {"title":"The Great Gatsby"},
    {"title":"Harold and Maude"},
    {"title":"The Last Picture Show"},
    {"title":"Julia"},
    {"title":"Dumbo"},
    {"title":"Romancing the Stone"},
    {"title":"The Sure Thing"},
    {"title":"Deliverance"},
    {"title":"The Song of Scorpions"},
    {"title":"Black Widow"},
    {"title":"The Thin Red Line"},
    {"title":"The Adventures of Tintin"},
    {"title":"When Harry Met Sally..."},
    {"title":"Say Anything"},
    {"title":"Pretty in Pink"},
    {"title":"Sixteen Candles"},
    {"title":"An Officer and a Gentleman"},
    {"title":"Dirty Dancing"},
    {"title":"Moonstruck"},
    {"title":"Midsummer Madness","genres":["romance"],"year":2017,"rating":7.8,"description":"During Finland's magical Midsummer festival, two strangers embark on a whimsical journey of love and self-discovery amidst the midnight sun."},
    {"title":"My Sassy Girl"},
    {"title":"The Classic"},
    {"title":"A Moment to Remember"},
    {"title":"Viola"},
    {"title":"200 Pounds Beauty"},
    {"title":"P.S. I Love You"},
    {"title":"Windstruck"},
    {"title":"The Princess Diaries"},
    {"title":"My Little Bride"},
    {"title":"A Love Song"},
    {"title":"They Live"},
    {"title":"In the Heat of the Night"},
    {"title":"Purple Rain"},
    {"title":"Platoon"},
    {"title":"Violent Cop"},
    {"title":"Toy Story 2","genres":["animation"]},
    {"title":"Finding Nemo","genres":["animation"],"year":2003,"rating":8.1,"description":"A clownfish embarks on an epic journey to rescue his son who has been captured by a diver."},
    {"title":"Pulp Fiction"},
    {"title":"Willow","genres":["fantasy"]},
    {"title":"Wreck-It Ralph","genres":["animation"],"year":2012,"rating":7.7,"description":"A video game villain wants to be a hero and sets out to fulfill his dream, but his quest brings havoc to the whole arcade."},
    {"title":"Monsters, Inc.","genres":["animation"],"year":2001,"rating":8.0,"description":"In a city of monsters, two creatures discover that a child can power their world."},
    {"title":"Coco","genres":["animation"],"year":2017,"rating":8.4,"description":"Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer."},
    {"title":"The Incredibles","genres":["animation"],"year":2004,"rating":8.0,"description":"A family of superheroes comes out of retirement to save the world."},
    {"title":"Hellboy"},
    {"title":"Savage Grace"},
    {"title":"Django"},
    {"title":"The Shawshank Redemption"},
    {"title":"The Godfather"},
    {"title":"12 Angry Men"},
    {"title":"Schindler's List"},
    {"title":"The Lord of the Rings: The Return of the King"},
    {"title":"The Lord of the Rings: The Fellowship of the Ring"},
    {"title":"The Lord of the Rings: The Two Towers"},
    {"title":"Fight Club"},
    {"title":"Goodfellas"},
    {"title":"Seven Samurai"},
    {"title":"Saving Private Ryan"},
    {"title":"City of God"},
    {"title":"Life Is Beautiful"},
    {"title":"Spirited Away"},
    {"title":"Grave of the Fireflies"},
    {"title":"Casablanca"},
    {"title":"Modern Times"},
    {"title":"Once Upon a Time in the West"},
    {"title":"2001: A Space Odyssey"},
    {"title":"Eternal Sunshine of the Spotless Mind"},
    {"title":"Ikiru"},
    {"title":"Indiana Jones and the Temple of Doom"},
    {"title":"Spartacus"},
    {"title":"Citizen Kane"},
    {"title":"Full Metal Jacket"},
    {"title":"Snatch"},
    {"title":"Into the Wild"},
    {"title":"Groundhog Day"},
    {"title":"White Chicks"},
    {"title":"Twisters"},
    {"title":"Bad Boys: Ride or Die"},
    {"title":"Fly Me to the Moon"},
    {"title":"Avengers: Endgame"},
    {"title":"Hotel Rwanda"},
    {"title":"WALL·E"},
    {"title":"Before Sunset"},
    {"title":"Mickey: The Story of a Mouse"},
    {"title":"Stand by Me"},
    {"title":"The Wizard of Oz"},
    {"title":"The Sound of Music"},
    {"title":"Trainspotting"},
    {"title":"Catch Me If You Can"},
    {"title":"Million Dollar Baby"},
    {"title":"Barry Lyndon"},
    {"title":"Wild Strawberries"},
    {"title":"The Wolf of Wall Street"},
    {"title":"Green Book"},
    {"title":"Top Gun: Maverick"},
    {"title":"Gone with the Wind"},
    {"title":"Rumble in the Bronx"},
    {"title":"Reservoir Dogs"},
    {"title":"True Romance"},
    {"title":"Jackie Brown"},
    {"title":"9 to 5"},
    {"title":"Alien Showdown: The Day the Old West Stood Still"},
    {"title":"The Day the Earth Stood Still"},
    {"title":"Django Unchained"},
    {"title":"The Batman"},
    {"title":"The Witcher: Nightmare of the Wolf"},
    {"title":"American Pie"},
    {"title":"American Pie 2"},
    {"title":"American Wedding"},
    {"title":"The Usual Suspects"},
    {"title":"Three Days of the Condor"},
    {"title":"Aladdin","genres":["animation"],"year":1992,"rating":8.0,"description":"A kind-hearted street urchin and a power-hungry Grand Vizier vie for a magic lamp that has the power to make their deepest wishes come true."},
    {"title":"Shrek","genres":["animation"],"year":2001,"rating":7.8,"description":"An ogre, in order to regain his swamp, travels along with an annoying donkey in order to bring a princess to a scheming lord, wishing himself King."},
    {"title":"The Little Mermaid","genres":["animation"],"year":1989,"rating":7.6,"description":"A mermaid princess makes a Faustian bargain in an attempt to become human and win a prince's love."},
    {"title":"Ratatouille","genres":["animation"],"year":2007,"rating":8.0,"description":"A rat who can cook makes an unusual alliance with a young kitchen worker at a famous Parisian restaurant."},
    {"title":"Beauty and the Beast","genres":["animation"],"year":1991,"rating":8.0,"description":"A prince cursed to spend his days as a hideous monster sets out to regain his humanity by earning a young woman's love."},
    {"title":"Up","genres":["animation"],"year":2009,"rating":8.2,"description":"Seventy-eight-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway."},
    {"title":"Moana","genres":["animation"],"year":2016,"rating":7.6,"description":"In Ancient Polynesia, when a terrible curse incurred by the Demigod Maui reaches Moana's island, she answers the Ocean's call to seek out the Demigod to set things right."},
    {"title":"Inside Out","genres":["animation"],"year":2015,"rating":8.1,"description":"After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust and Sadness - conflict on how best to navigate a new city, house, and school."},
    {"title":"Toy Story 3","genres":["animation"],"year":2010,"rating":8.2,"description":"The toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys that they weren't abandoned and to return home."},
    {"title":"Finding Dory","genres":["animation"],"year":2016,"rating":7.3,"description":"Friendly but forgetful blue tang Dory begins a search for her long-lost parents, and everyone learns a few things about the real meaning of family along the way."},
    {"title":"Cars","genres":["animation"],"year":2006,"rating":7.1,"description":"A hot-shot race-car named Lightning McQueen gets waylaid in Radiator Springs, where he finds the true meaning of friendship and family."},
    {"title":"Mulan","genres":["animation"],"year":1998,"rating":7.6,"description":"To save her father from death in the army, a young maiden secretly goes in his place and becomes one of China's greatest heroines in the process."},
    {"title":"Brave","genres":["animation"],"year":2012,"rating":7.1,"description":"Determined to make her own path in life, Princess Merida defies a custom that brings chaos to her kingdom. Granted one wish, Merida must rely on her bravery and her archery skills to undo a beastly curse."},
    {"title":"Big Hero 6","genres":["animation"],"year":2014,"rating":7.8,"description":"A special bond develops between plus-sized inflatable robot Baymax and prodigy Hiro Hamada, who together team up with a group of friends to form a band of high-tech heroes."},
    {"title":"The Nightmare Before Christmas","genres":["animation"],"year":1993,"rating":8.0,"description":"Jack Skellington, king of Halloween Town, discovers Christmas Town, but his attempts to bring Christmas to his home causes confusion."},
    {"title":"Shrek 2","genres":["animation"],"year":2004,"rating":7.2,"description":"Princess Fiona's parents invite her and Shrek to dinner to celebrate her marriage. If only they knew the newlyweds were both ogres."},
    {"title":"Shrek the Third"},
    {"title":"Shrek Forever After"},
    {"title":"The Killer"},
    {"title":"Looper"},
    {"title":"Starship Troopers"},
    {"title":"Batman v Superman: Dawn of Justice"},
    {"title":"Batman"},
    {"title":"Batman Begins"},
    {"title":"Batman Forever"},
    {"title":"Batman Returns"},
    {"title":"Batman & Robin"},
    {"title":"Above the Law"},
    {"title":"Savages"},
    {"title":"Under Siege"},
    {"title":"The Breaking Point"},
    {"title":"The Da Vinci Code"},
    {"title":"Sweet Home Alabama"},
    {"title":"Civil War"},
    {"title":"Treasure Island"},
    {"title":"Moby Dick"},
    {"title":"White House Down"}
]
